<!-- 16.04.26 -->
# Подготовка к экзамену:
## Тип 2
### Задание 1 (№ 28677) 
Логическая функция F задаётся выражением 
((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). 
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.


| ??? | ??? | ??? | ??? | F |
|:---:|:---:|:---:|:---:|:-:|
|  1  |  0  |  0  |  1  | 1 |
|  0  |     |     |  1  | 1 |
|     |  1  |  0  |     | 1 |

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы. Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
```
for x in range(0, 2):    #
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x==y) <= ((not(z)) or w)) == (not ((w <= x) or (y <= z))):
                    print(x, y, z, w)
```
#### Решение
Ответ: wzyx
### Задание 2 (№ 60244)
Миша заполнял таблицу истинности логической функции F

(x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w,

но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
| Переменная 1 | Переменная 2 | Переменная 3 | Переменная 4 | Функция |
|:------------:|:------------:|:------------:|:------------:|:-------:|
|              |              |       0      |       0      |    0    |
|       1      |       0      |              |       0      |    0    |
|       1      |       0      |       1      |              |    0    |

Определите, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if (x and ((not y)) or (y == z) or (not w)) == False:
                    print(x, y, z, w)
```
Ответ: wzyx

### Задание 3 (№ 29650)
Логическая функция F задаётся выражением 

(w ∨ ¬x) ∧ (w ≡ ¬y) ∧ (w → z). 

На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 

Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
| Переменная 1 | Переменная 2 | Переменная 3 | Переменная 4 | Функция |
|:------------:|:------------:|:------------:|:------------:|:-------:|
|       1      |              |       1      |       1      |    1    |
|              |              |       1      |              |    1    |
|       1      |              |       1      |              |    1    |

```
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if ((w or (not x)) and (w == (not y)) and (w <= z)):
                    print(x, y, z, w)
```
Ответ: wyzx
## Тип 8
### Задание 1 (№ 13486)
Игорь составляет таблицу кодовых слов для передачи сообщений, каждому сообщению соответствует своё кодовое слово. В качестве кодовых слов Игорь использует 5-⁠буквенные слова, в которых есть только буквы A, B, C, X, причём буква X появляется ровно 1 раз и только на 1-⁠й или последней позиции слова. Каждая из других допустимых букв может встречаться в кодовом слове любое количество раз или не встречаться совсем. Сколько различных кодовых слов может использовать Игорь?

```
a = 'АВСХ'
c = 0
for i in a:
    for j in a:
        for k in a:
            for l in a:
                for m in a:
                    s=i+j+k+l+m
                    if s.count('Х') == 1 and (s[0] == 'Х' or s[-1] == 'Х'):
                        c = c + 1
print(c)
```
Ответ: 162

### Задание 2 (№ 16037)
Вася составляет 5-⁠буквенные слова, в которых есть только буквы З, И, М, А, причём в каждом слове есть ровно одна гласная буква и она встречается ровно 1 раз. Каждая из допустимых согласных букв может встречаться в слове любое количество раз или не встречаться совсем. Словом считается любая допустимая последовательность букв, не обязательно осмысленная. Сколько существует таких слов, которые может написать Вася?

```
a = 'ЗИМА'
c = 0
for i in a:
    for j in a:
        for k in a:
            for l in a:
                for m in a:
                    s=i+j+k+l+m
                    if s.count('И') == 1 and s.count('А') == 0 or s.count('А') == 1 and s.count('И') == 0:
                       c = c + 1
print(c)
```
Ответ: 160

### Задание 3 (№ 69886)
Определите количество 9-⁠ричных 6-⁠значных чисел, которые не начинаются с нечетных цифр, не оканчиваются цифрами 2 или 3, содержат не менее двух цифр 1.

```
count = 0
for a in '2468':
    for b in '012345678':
        for c in '012345678':
            for d in '012345678':
                for e in '012345678':
                    for f in '0145678':
                        s=a+b+c+d+e+f
                        if s.count("1") >= 2:
                            count += 1
print(count)
```
Ответ: 19868
